#!/bin/bash
#==============================================
#
# git 部署配置信息
#
#==============================================
# 定义默认commit备注
default_commit="auto git";

#==============================================
#
# commit 备注信息填写
#
#==============================================
# commit备注提示输入
read -p "请输入 commit 备注信息: " commit

# 备注信息为空赋默认值
if [ ! -n "$commit" ];then
	commit=${default_commit};
fi

#==============================================
#
# git 命令执行
#
#==============================================
git pull origin master && \
git add . && \
git commit -m "${commit}" && \
git push origin master